app/views/hacks/_basic.html.erb

SELECT "hack_validations".* FROM "hack_validations" WHERE "hack_validations"."hack_id" = $1 LIMIT $2  [["hack_id", 395], ["LIMIT", 1]]
---
          <span><%= hack.title %>
            <span class="<%= class_for_boolean(hack.hack_validation.present? ? hack.hack_validation.status : hack.is_hack?) %> inline-block ml-2"><%= text_for_boolean(hack.hack_validation.present? ? hack.hack_validation.status : hack.is_hack?) %></span>

SELECT "queries".* FROM "queries" WHERE "queries"."hack_id" = $1  [["hack_id", 395]]
---
            <ul class="pl-4">
              <% hack.queries.each do |query| %>