app/controllers/hacks_controller.rb

  def show
    @channel = current_user.channels.where(id: params[:channel_id]).first
---
SELECT "channels".* FROM "channels" WHERE "channels"."user_id" = $1 AND "channels"."id" = $2 ORDER BY "channels"."id" ASC LIMIT $3  [["user_id", 7], ["id", 41], ["LIMIT", 1]]